Repository: shauritanga/via
Catalog: lib/l10n/app_*.arb
Languages: sw

# appTitle
source: VIA - Voice Interactive Assistant
sw: VIA - Msaidizi wa Sauti

# welcome
source: Welcome to VIA
sw: Karibu VIA

source: Documents
sw: Hati

source: Settings
sw: Mipangilio

source: Upload Document
sw: Pakia Hati

source: Delete Document
sw: Futa Hati

source: Open Document
sw: Fungua Hati

source: Read Document
sw: Soma Hati

source: Stop Reading
sw: Acha Kusoma

source: Pause Reading
sw: Simamisha Kusoma

source: Resume Reading
sw: Endelea Kusoma

source: Next Page
sw: Ukurasa Unaofuata

source: Previous Page
sw: Ukurasa Uliotangulia

source: Go to Page
sw: Nenda Ukurasa

source: Page {number}
sw: Ukurasa {number}

source: {total} pages
sw: Kurasa {total}

source: Language
sw: Lugha

source: English
sw: Kiingereza

source: Swahili
sw: Kiswahili

source: Speech Settings
sw: Mipangilio ya Sauti

source: Speech Rate
sw: Kasi ya Kusema

source: Pitch
sw: Mlolongo wa Sauti

source: Volume
sw: Kiwango cha Sauti

source: Accessibility Settings
sw: Mipangilio ya Ufikaji

source: High Contrast Mode
sw: Hali ya Utofauti Mkubwa

source: Text Size
sw: Ukubwa wa Maandishi

source: Voice Feedback
sw: Majibu ya Sauti

source: Haptic Feedback
sw: Majibu ya Kugusa

source: Voice Commands
sw: Amri za Sauti

source: Start Listening
sw: Anza Kusikiliza

source: Stop Listening
sw: Acha Kusikiliza

source: Listening...
sw: Ninasikiliza...

# speakCommand
source: Speak a command
sw: Sema amri

source: Command not recognized
sw: Amri haijatambuliwa

# noDocuments
source: No documents found
sw: Hakuna hati zilizopatikana

source: Uploading document...
sw: Ninapakia hati...

# documentUploaded
source: Document uploaded successfully
sw: Hati imepakiwa kwa mafanikio

# documentDeleted
source: Document deleted successfully
sw: Hati imefutwa kwa mafanikio

source: Error
sw: Hitilafu

# networkError
source: Please check your internet connection
sw: Tafadhali angalia muunganisho wako wa mtandao

# permissionDenied
source: Permission denied. Please grant required permissions
sw: Ruhusa imekataliwa. Tafadhali toa ruhusa zinazohitajika

source: File not found
sw: Faili halijapatikana

source: Unsupported file type
sw: Aina ya faili haihamiliwi

# fileTooLarge
source: File size exceeds maximum limit
sw: Ukubwa wa faili umezidi kikomo cha juu

source: Cancel
sw: Ghairi

source: OK
sw: Sawa

source: Save
sw: Hifadhi

source: Help
sw: Msaada

source: About
sw: Kuhusu
